app/controllers/home_controller.rb

SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
INSERT INTO "generic_logs" ("created_at", "operation", "request_log", "response_log", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def index
    session[:msisdn] = params[:msisdn]
    if not_a_phone_number?(params[:msisdn])
      flash.now[:error] = "Veuillez entrer un numéro de téléphone valide"
      render :get_msisdn
    else
      url = Parameter.first.gateway_url + "/85fg69a7a9c59f3a0/api/users/password/#{session[:msisdn]}"
      password_salt = RestClient.get(url) rescue ''

      GenericLog.create(operation: "Check user existence", request_log: url, response_log: password_salt)

SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
INSERT INTO "generic_logs" ("created_at", "operation", "request_log", "response_log", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create_parionsdirect_account
    @pseudo = "#{Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..8]}"
    @firstname = 'Parionsdirect'
    @lastname = 'Parionsdirect'
    @email = "ussd-#{Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..8]}@direct.ci"
    @password = params[:password]
    @password_confirmation = params[:password_confirmation]
    @birthdate = '12-12-1900'

    if valid_parionsdirect_account_params?
      url = Parameter.first.gateway_url + "/6ba041bf35229938ba869a7a9c59f3a0/api/users/account/create/1/1/#{@pseudo}/#{@firstname}/#{@lastname}/#{@email}/#{@password}/#{@password_confirmation}/#{session[:msisdn]}/#{@birthdate}/d2a29d336c48fe68df6e5827cc49a042"

      parionsdirect_account = RestClient.get(url) rescue nil
      GenericLog.create(operation: "Create parionsdirect account", request_log: url, response_log: parionsdirect_account)

SELECT  "account_profiles".* FROM "account_profiles"  WHERE "account_profiles"."msisdn" = '58908957' LIMIT 1
---
  def authenticate_parionsdirect_account
    password = Digest::SHA2.hexdigest(session[:salt] + params[:password])

    if password == session[:password]
      #url = Parameter.first.paymoney_url + "/rest/check4_compte/#{session[:msisdn]}"
      #paymoney_account = RestClient.get(url) rescue nil
      paymoney_account = AccountProfile.find_by_msisdn(session[:msisdn]).paymoney_account_number rescue nil

SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
INSERT INTO "generic_logs" ("created_at", "operation", "request_log", "response_log", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def list_otp
    password = params[:password]

    if password.blank?
      flash.now[:error] = "Veuillez saisir un mot de passe"
      render :otp
    else
      url = Parameter.first.paymoney_url + "/PAYMONEY_WALLET/rest/getLastOtp/#{session[:paymoney_account_number]}/#{password}/"
      otps = RestClient.get(url) rescue ""

      GenericLog.create(operation: "List OTP", request_log: url, response_log: otps)