app/controllers/loto_controller.rb

  def place_bet
    @gamer_id = RestClient.get(Parameter.first.gateway_url + "/8ba869a7a9c59f3a0/api/users/gamer_id/#{session[:msisdn]}") rescue ''
---
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

          end
        end

        Log.create(msisdn: session[:msisdn], gamer_id: @gamer_id, paymoney_account_number: @paymoney_account_number, paymoney_password: @paymoney_account_password, drawing: session[:drawing], bet: session[:bet], formula: session[:formula], bet_request: request_body, bet_response: body, status: status)
---
INSERT INTO "logs" ("bet", "bet_request", "bet_response", "created_at", "drawing", "formula", "gamer_id", "msisdn", "paymoney_account_number", "paymoney_password", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"