app/controllers/plr_controller.rb

SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
INSERT INTO "generic_logs" ("created_at", "operation", "request_log", "response_log", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def set_bet_params
    url = Parameter.first.parionsdirect_url + "/ussd_pmu/get_plr_race_list_info/R#{session[:plr_reunion_number]}/C#{session[:plr_race_number]}"
    races = RestClient.get(url) rescue nil

    GenericLog.create(operation: "List PMU PLR races", request_log: url, response_log: races)