app/controllers/pmu_alr_controller.rb

  def index
    session[:full_box] = 'FALSE'
    url = Parameter.first.parionsdirect_url + "/ussd_pmu/get_alr_current_program"
    session_data = RestClient.get(url) rescue nil

    GenericLog.create(operation: "PMU ALR get session data", request_log: url, response_log: session_data)
---
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
INSERT INTO "generic_logs" ("created_at", "operation", "request_log", "response_log", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def evaluate_bet
    @stake = params[:stake]

    if @stake.blank? || not_a_number?(@stake)
      flash.now[:error] = "Veuillez entrer un nombre de fois valide"
      render :stake
    else
      session[:alr_stake] = @stake
      set_bet_parameters

      url = Parameter.first.gateway_url + "/cm3/api/0cad36b144/game/evaluate/#{@program_id}/#{@race_id}"
---
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

        end
      end

      GenericLog.create(operation: "Evaluate PMU ALR bet", request_log: url + request_body, response_log: body)
---
INSERT INTO "generic_logs" ("created_at", "operation", "request_log", "response_log", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"