app/controllers/ussd_testing_controller.rb

INSERT INTO "mtn_start_session_logs" ("created_at", "request_code", "request_headers", "request_log", "request_url", "response_log", "total_time", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      status = false
    end

    MtnStartSessionLog.create(operation_type: "Start session", request_url: url, request_log: request_body, response_log: start_session_response.body, request_code: start_session_response.code, total_time: start_session_response.total_time, request_headers: start_session_response.headers.to_s, error_code: error_code, error_message: error_message, status: status, correlator_id: correlator_id)

INSERT INTO "ussd_reception_logs" ("code_scheme", "created_at", "error_code", "error_message", "msg_type", "msisdn", "received_parameters", "receiver_cb", "remote_ip", "rev_id", "rev_password", "sender_cb", "service_code", "service_id", "sp_id", "timestamp", "trace_unique_id", "updated_at", "ussd_of_type", "ussd_string") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
    # Responds to the SDP depending on the message type (sendussd or abort response)
    set_main_menu_result_text(@abort_reason, @error_code)

    UssdReceptionLog.create(received_parameters: @req_body, rev_id: @rev_id, rev_password: @rev_password, sp_id: @sp_id, service_id: @service_id, timestamp: @timestamp, trace_unique_id: @unique_id, msg_type: @msg_type, sender_cb: @sender_cb, receiver_cb: @receive_cb, ussd_of_type: @ussd_op_type, msisdn: @msisdn, service_code: @service_code, code_scheme: @code_scheme, ussd_string: @ussd_string, error_code: @error_code, error_message: @error_message, remote_ip: remote_ip_address)

SELECT  "mtn_start_session_logs".* FROM "mtn_start_session_logs"   ORDER BY "mtn_start_session_logs"."id" DESC LIMIT 1
---
  def start_ussd_log
    render text: MtnStartSessionLog.last.to_yaml